Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope.#ctor(Autodesk.Revit.DB.Document)
Instantiates a default IFCLinkDocumentExportScope object.
pADoc:
The linked document to export.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope
A class that allows for the export of one linked document to IFC.
Remarks:
Linked documents can only be exported within a transaction, but it is illegal to start
a transaction for a linked document.  This gives a special exception that does the
work necessary to make sure that the host documents do not end up in unstable states
after the export.  This is not guaranteed for any other workflow.
To ensure that the lifetime of the object is correctly managed, you should declare an instance
of this class as a part of a 'using' statement in C# or similar construct in other lanuguages.
Since:
2024